Revit 2027 API
AreaBasedLoadData.RemoveElectricalLoadArea Method
 Removes electrical load area from the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveElectricalLoadArea(
	ElementId electricalLoadAreaId
)
Public Sub RemoveElectricalLoadArea (
	electricalLoadAreaId As ElementId
)
public:
void RemoveElectricalLoadArea(
	ElementId^ electricalLoadAreaId
)
member RemoveElectricalLoadArea :
        electricalLoadAreaId : ElementId -> unit
Parameters
electricalLoadAreaId ElementId
 The electrical load area id to remove.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace